sample/hr/swarm-hr-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client1-t4-c512-d30-R2500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=2500
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 1331.884ms, rate sampling interval: 7307ms
  Thread calibration: mean lat.: 1323.191ms, rate sampling interval: 7426ms
  Thread calibration: mean lat.: 1291.969ms, rate sampling interval: 7200ms
  Thread calibration: mean lat.: 1516.688ms, rate sampling interval: 7720ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.83s     2.93s   15.20s    63.60%
    Req/Sec   344.62     16.04   365.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.73s 
 75.000%   11.02s 
 90.000%   12.79s 
 99.000%   15.20s 
 99.900%   17.24s 
 99.990%   18.84s 
 99.999%   19.30s 
100.000%   19.30s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1110.015     0.000000            1         1.00
    5038.079     0.100000         2731         1.11
    6041.599     0.200000         5450         1.25
    6955.007     0.300000         8173         1.43
    7884.799     0.400000        10908         1.67
    8732.671     0.500000        13627         2.00
    9175.039     0.550000        15008         2.22
    9609.215     0.600000        16354         2.50
   10067.967     0.650000        17720         2.86
   10526.719     0.700000        19075         3.33
   11018.239     0.750000        20445         4.00
   11272.191     0.775000        21126         4.44
   11526.143     0.800000        21791         5.00
   11812.863     0.825000        22471         5.71
   12115.967     0.850000        23156         6.67
   12427.263     0.875000        23835         8.00
   12615.679     0.887500        24183         8.89
   12787.711     0.900000        24522        10.00
   12984.319     0.912500        24861        11.43
   13205.503     0.925000        25195        13.33
   13434.879     0.937500        25535        16.00
   13565.951     0.943750        25716        17.78
   13713.407     0.950000        25885        20.00
   13852.671     0.956250        26054        22.86
   14016.511     0.962500        26218        26.67
   14213.119     0.968750        26391        32.00
   14311.423     0.971875        26473        35.56
   14458.879     0.975000        26562        40.00
   14573.567     0.978125        26645        45.71
   14712.831     0.981250        26729        53.33
   14843.903     0.984375        26814        64.00
   14917.631     0.985938        26856        71.11
   14999.551     0.987500        26899        80.00
   15114.239     0.989062        26942        91.43
   15253.503     0.990625        26985       106.67
   15409.151     0.992188        27025       128.00
   15491.071     0.992969        27047       142.22
   15630.335     0.993750        27067       160.00
   15720.447     0.994531        27089       182.86
   15867.903     0.995313        27110       213.33
   16023.551     0.996094        27132       256.00
   16130.047     0.996484        27142       284.44
   16211.967     0.996875        27152       320.00
   16343.039     0.997266        27163       365.71
   16441.343     0.997656        27176       426.67
   16572.415     0.998047        27184       512.00
   16621.567     0.998242        27190       568.89
   16859.135     0.998437        27195       640.00
   16941.055     0.998633        27200       731.43
   17104.895     0.998828        27206       853.33
   17235.967     0.999023        27211      1024.00
   17481.727     0.999121        27215      1137.78
   17498.111     0.999219        27216      1280.00
   17596.415     0.999316        27219      1462.86
   17825.791     0.999414        27222      1706.67
   17956.863     0.999512        27224      2048.00
   18071.551     0.999561        27226      2275.56
   18219.007     0.999609        27227      2560.00
   18251.775     0.999658        27228      2925.71
   18350.079     0.999707        27230      3413.33
   18448.383     0.999756        27231      4096.00
   18579.455     0.999780        27232      4551.11
   18579.455     0.999805        27232      5120.00
   18595.839     0.999829        27233      5851.43
   18841.599     0.999854        27234      6826.67
   18841.599     0.999878        27234      8192.00
   18939.903     0.999890        27235      9102.22
   18939.903     0.999902        27235     10240.00
   18939.903     0.999915        27235     11702.86
   18956.287     0.999927        27236     13653.33
   18956.287     0.999939        27236     16384.00
   18956.287     0.999945        27236     18204.44
   18956.287     0.999951        27236     20480.00
   18956.287     0.999957        27236     23405.71
   19300.351     0.999963        27237     27306.67
   19300.351     1.000000        27237          inf
#[Mean    =     8825.173, StdDeviation   =     2926.706]
#[Max     =    19283.968, Total count    =        27237]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  40698 requests in 30.07s, 16.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1353.38
Transfer/sec:    573.16KB